GHB2/src/Catalogs/гхб_Автомобили/гхб_Автомобили.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_Автомобили</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Персональные</name>
      <description>Персональні</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Службові</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипАвтомобиля</name>
    <type>
      <types>EnumRef.гхб_ТипАвтомобиляСлужебныйПерсональный</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_Автомобили/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
		_Массив = РегистрыСведений.гхб_НастройкиВозможностиРедактированияПарковочныеМеста.ВернутьДоступныеТипыАвтомобилейДляСотрудника(_ФЛ);
		
		Если ЗначениеЗаполнено(Объект.Ссылка) И (_Массив.Найти(Объект.ТипАвтомобиля) = Неопределено) Тогда
			ЭтотОбъект.ТолькоПросмотр = Истина;
		Иначе 	
			Элементы.ТипАвтомобиля.СписокВыбора.ЗагрузитьЗначения(_Массив);
			Элементы.ТипАвтомобиля.РежимВыбораИзСписка = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ГосударственныйНомер) Тогда
		_АвтомобильСТакимЖеНомером = 
			ПроверитьСуществованиеАвтомобиляПоГосударственномуНомеру(Объект.ГосударственныйНомер, Объект.Ссылка);
			
		Если ЗначениеЗаполнено(_АвтомобильСТакимЖеНомером) Тогда
			Отказ = Истина;
			
			_ТекстСообщения = НСтр("ru='Указанный гос.номер используется в другом автомобиле: " +  
				"';uk='Вказаний держ.номер використовується в іншому автомобілі: '") + СокрЛП(_АвтомобильСТакимЖеНомером);
			
			Сообщить(_ТекстСообщения, СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеАвтомобиляПоГосударственномуНомеру(_ГосударственныйНомер, _АвтомобильИскючение)
	
	Возврат Справочники.гхб_Автомобили.ВернутьАвтомобильПоГосударственномуНомеру(_ГосударственныйНомер, _АвтомобильИскючение);
	
КонецФункции
